Revit 2024 API
DockablePane.Show Method
 If the pane is not currently visible or in a tab, display the pane in the Revit user interface at its last docked location.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void Show()
Visual Basic
Public Sub Show
Visual C++
public:
void Show()
See Also
DockablePane Class
Autodesk.Revit.UI Namespace